Tekla Open API Reference for Tekla Structures 2025
AngleDimension Constructor (ViewBase, Point, Point, Point, Double)
 Creates a new angle dimension instance using three points.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AngleDimension(
	ViewBase View,
	Point Origin,
	Point Point1,
	Point Point2,
	double Distance
)
Public Sub New (
	View As ViewBase,
	Origin As Point,
	Point1 As Point,
	Point2 As Point,
	Distance As Double
)
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
Origin
Type: Tekla.Structures.Geometry3d.Point
The origin to be used.
Point1
Type: Tekla.Structures.Geometry3d.Point
The first point to be used.
Point2
Type: Tekla.Structures.Geometry3d.Point
The second point to be used.
Distance
Type: System.Double
The distance of the angle sign from the origin to the first point.
See Also
Reference
AngleDimension Class
AngleDimension Overload
Tekla.Structures.Drawing Namespace